inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <micro_ros_arduino.h>
#include <freertos/FreeRTOS.h>
#include <freertos/portmacro.h>
#include <freertos/task.h>
#include <esp_task_wdt.h>
#include <driver/gpio.h>
#include <stdio.h>

#include "config/app_config.h"
#include "bridge/motor_command_parser.h"
#include "motor/encoder_rpm_estimator.h"
#include "motor/motor_controller.h"
#include "motor/motor_control_shared.h"
#include "motor/single_motor_control.h"
#include "motor/speed_pid.h"
#include "motor/tb6612_driver.h"
#include "bridge/stm32_serial_parser.h"
#include "ros/uros_core.h"
#include "ros/uros_pub.h"
#include "ros/uros_sub.h"

namespace {

HardwareSerial STM32Serial(1);

TaskHandle_t ros_comm_task_handle = nullptr;
TaskHandle_t motor_control_task_handle = nullptr;

bool wifi_connected = false;
bool transport_configured = false;
bool micro_ros_initialized = false;
unsigned long last_wifi_attempt_ms = 0;
unsigned long last_micro_ros_init_attempt_ms = 0;
unsigned long last_runtime_debug_ms = 0;
unsigned long last_imu_publish_ms = 0;
unsigned long last_filtered_imu_publish_ms = 0;
unsigned long last_robot_state_publish_ms = 0;
unsigned long last_motor_actual_rpm_publish_ms = 0;
unsigned long last_motor_state_json_publish_ms = 0;

struct RuntimeTaskStats {
    uint32_t ros_comm_loop_count;
    uint32_t ros_comm_max_loop_interval_ms;
    uint32_t motor_control_loop_count;
    uint32_t motor_control_max_jitter_ms;
};

portMUX_TYPE runtime_stats_mux = portMUX_INITIALIZER_UNLOCKED;
RuntimeTaskStats runtime_task_stats = {};

portMUX_TYPE encoder_bench_mux = portMUX_INITIALIZER_UNLOCKED;
volatile int32_t n20_encoder_bench_count = 0;
volatile uint32_t n20_encoder_bench_invalid_transitions = 0;
volatile uint8_t n20_encoder_bench_last_state = 0;

struct N20ClosedLoopBenchConfig {
    uint32_t control_period_ms;
    uint32_t print_interval_ms;
    uint32_t max_duration_ms;
    uint32_t direction_change_coast_ms;
    bool invert_encoder_direction;
    float max_target_rpm;
    float max_pwm;
    float min_effective_pwm;
    float deadband_rpm;
    uint32_t max_invalid_encoder_transitions;
    uint32_t profile_stop_ms;
    EncoderRpmEstimatorConfig encoder;
    uint32_t profile_step1_start_ms;
    uint32_t profile_step2_start_ms;
    uint32_t profile_step3_start_ms;
    uint32_t profile_step4_start_ms;
    uint32_t profile_step5_start_ms;
    float profile_step0_target_rpm;
    float profile_step1_target_rpm;
    float profile_step2_target_rpm;
    float profile_step3_target_rpm;
    float profile_step4_target_rpm;
    float profile_step5_target_rpm;
    SpeedPidConfig pid;
};

struct N20ClosedLoopBenchRuntime {
    Tb6612Driver tb6612;
    SpeedPidRuntime pid;
    EncoderRpmEstimatorRuntime encoder;
    uint32_t last_control_ms;
    uint32_t last_print_ms;
    uint32_t start_ms;
    uint32_t direction_hold_until_ms;
    int32_t last_encoder_delta;
    float last_raw_rpm;
    float last_filtered_rpm;
    float last_target_rpm;
    float last_pwm;
    float last_error;
    int8_t last_direction;
    int8_t drive_direction;
    bool last_output_saturated;
    bool csv_header_printed;
    bool completed;
    bool initialized;
    bool driver_ready;
};

struct N20OpenLoopSweepRuntime {
    Tb6612Driver tb6612;
    EncoderRpmEstimatorRuntime encoder;
    uint32_t start_ms;
    uint32_t last_sample_ms;
    uint32_t last_print_ms;
    int32_t last_encoder_delta;
    int32_t last_encoder_count;
    float last_raw_rpm;
    float last_filtered_rpm;
    float last_pwm;
    bool csv_header_printed;
    bool completed;
    bool initialized;
    bool driver_ready;
};

struct DashboardMotorClosedLoopConfig {
    EncoderRpmEstimatorConfig encoder;
    SingleMotorControlConfig control;
    bool invert_encoder_direction;
};

void handleParsedImuSample(const STM32ImuSample& sample);
void handleParsedState(int32_t state);
void handleCmdVel(float linear_x, float angular_z);
void handleTargetRpm(float target_rpm);
void handleMotorCmd(const char* payload);
void handleDebugLine(const char* line);
Tb6612DriverConfig makeTb6612ChannelBBenchConfig();

STM32SerialParser stm32_parser(
    handleParsedImuSample,
    handleParsedState,
    handleDebugLine,
    app_config::kAcceptTrainCsvAsImu);

bool isIntervalDue(unsigned long now_ms, unsigned long last_ms, unsigned long interval_ms) {
    return last_ms == 0 || (now_ms - last_ms) >= interval_ms;
}

float clampFloat(float value, float min_value, float max_value) {
    if (value < min_value) {
        return min_value;
    }
    if (value > max_value) {
        return max_value;
    }
    return value;
}

void noteRosCommLoop() {
    static uint32_t last_loop_ms = 0;
    const uint32_t now_ms = millis();
    const uint32_t interval_ms = (last_loop_ms == 0) ? 0U : now_ms - last_loop_ms;
    last_loop_ms = now_ms;

    portENTER_CRITICAL(&runtime_stats_mux);
    runtime_task_stats.ros_comm_loop_count++;
    if (interval_ms > runtime_task_stats.ros_comm_max_loop_interval_ms) {
        runtime_task_stats.ros_comm_max_loop_interval_ms = interval_ms;
    }
    portEXIT_CRITICAL(&runtime_stats_mux);
}

void noteMotorControlLoop() {
    static uint32_t last_loop_ms = 0;
    const uint32_t now_ms = millis();
    const uint32_t interval_ms = (last_loop_ms == 0) ? app_config::kMotorControlTaskPeriodMs : now_ms - last_loop_ms;
    const uint32_t jitter_ms =
        (interval_ms > app_config::kMotorControlTaskPeriodMs)
            ? interval_ms - app_config::kMotorControlTaskPeriodMs
            : app_config::kMotorControlTaskPeriodMs - interval_ms;
    last_loop_ms = now_ms;

    portENTER_CRITICAL(&runtime_stats_mux);
    runtime_task_stats.motor_control_loop_count++;
    if (jitter_ms > runtime_task_stats.motor_control_max_jitter_ms) {
        runtime_task_stats.motor_control_max_jitter_ms = jitter_ms;
    }
    portEXIT_CRITICAL(&runtime_stats_mux);
}

RuntimeTaskStats snapshotRuntimeTaskStatsAndResetPeaks() {
    portENTER_CRITICAL(&runtime_stats_mux);
    const RuntimeTaskStats snapshot = runtime_task_stats;
    runtime_task_stats.ros_comm_max_loop_interval_ms = 0U;
    runtime_task_stats.motor_control_max_jitter_ms = 0U;
    portEXIT_CRITICAL(&runtime_stats_mux);
    return snapshot;
}

uint32_t stackHighWaterBytes(TaskHandle_t handle) {
    if (handle == nullptr) {
        return 0U;
    }
    return (uint32_t)uxTaskGetStackHighWaterMark(handle);
}

uint8_t readN20EncoderBenchState() {
    const uint8_t a =
        (uint8_t)gpio_get_level((gpio_num_t)app_config::kN20BenchEncoderAPin);
    const uint8_t b =
        (uint8_t)gpio_get_level((gpio_num_t)app_config::kN20BenchEncoderBPin);
    return (uint8_t)((a << 1U) | b);
}

