inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
int8_t directionForTargetRpm(float rpm) {
    if (rpm > 0.0f) {
        return 1;
    }
    if (rpm < 0.0f) {
        return -1;
    }
    return 0;
}

float clampTargetRpm(float target_rpm, float max_target_rpm) {
    const float max_abs_target_rpm = (max_target_rpm < 0.0f) ? -max_target_rpm : max_target_rpm;
    return clampFloat(target_rpm, -max_abs_target_rpm, max_abs_target_rpm);
}

bool n20ClosedLoopBenchConfigValid(const N20ClosedLoopBenchConfig& config) {
    return config.control_period_ms > 0U &&
        config.print_interval_ms > 0U &&
        config.max_duration_ms > 0U &&
        config.encoder.counts_per_output_rev > 0.0f &&
        config.max_pwm >= 0.0f &&
        config.max_pwm <= 1.0f &&
        config.min_effective_pwm >= 0.0f &&
        config.min_effective_pwm <= config.max_pwm &&
        config.profile_stop_ms <= config.max_duration_ms;
}

const float* n20OpenLoopSweepPwmSteps(size_t& step_count) {
    static const float kSteps[] = {
        app_config::kN20OpenLoopSweepPwm0,
        app_config::kN20OpenLoopSweepPwm1,
        app_config::kN20OpenLoopSweepPwm2,
        app_config::kN20OpenLoopSweepPwm3,
        app_config::kN20OpenLoopSweepPwm4,
        app_config::kN20OpenLoopSweepPwm5,
        app_config::kN20OpenLoopSweepPwm6,
    };
    step_count = sizeof(kSteps) / sizeof(kSteps[0]);
    return kSteps;
}

void n20OpenLoopSweepStop(N20OpenLoopSweepRuntime& runtime, const char* reason) {
    if (reason != nullptr && reason[0] != '\0') {
        Serial.print("[N20_OPEN_LOOP_SWEEP] stop: ");
        Serial.println(reason);
    }

    if (runtime.driver_ready) {
        runtime.tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
        runtime.tb6612.setStandby(false);
    }

    stopN20EncoderBench();
    encoderRpmEstimatorInit(runtime.encoder);
    runtime.start_ms = 0U;
    runtime.last_sample_ms = 0U;
    runtime.last_print_ms = 0U;
    runtime.last_encoder_delta = 0;
    runtime.last_encoder_count = 0;
    runtime.last_raw_rpm = 0.0f;
    runtime.last_filtered_rpm = 0.0f;
    runtime.last_pwm = 0.0f;
    runtime.driver_ready = false;
    runtime.initialized = false;
}

bool n20OpenLoopSweepInit(N20OpenLoopSweepRuntime& runtime, uint32_t now_ms) {
    if (runtime.initialized) {
        return runtime.driver_ready;
    }

    runtime = {};
    encoderRpmEstimatorInit(runtime.encoder);

    if (!runtime.tb6612.begin(makeTb6612ChannelBBenchConfig())) {
        Serial.println("[N20_OPEN_LOOP_SWEEP] TB6612 B init failed");
        return false;
    }

    runtime.tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
    runtime.tb6612.setStandby(false);

    startN20EncoderBench();
    EncoderRpmEstimatorConfig encoder_config = {};
    encoder_config.counts_per_output_rev =
        app_config::kN20ClosedLoopBenchEncoderPulsesPerRev *
        app_config::kN20ClosedLoopBenchGearRatio *
        app_config::kN20ClosedLoopBenchEdgesPerPulse;
    encoder_config.filter_alpha = app_config::kN20ClosedLoopBenchEncoderFilterAlpha;
    encoderRpmEstimatorUpdate(
        runtime.encoder,
        encoder_config,
        n20EncoderBenchCountSnapshot(),
        app_config::kN20OpenLoopSweepPrintIntervalMs);

    runtime.start_ms = now_ms;
    runtime.last_sample_ms = now_ms;
    runtime.last_print_ms = 0U;
    runtime.last_encoder_count = n20EncoderBenchCountSnapshot();
    runtime.csv_header_printed = false;
    runtime.completed = false;
    runtime.driver_ready = true;
    runtime.initialized = true;

    Serial.print("[N20_OPEN_LOOP_SWEEP] enabled step_ms=");
    Serial.println(app_config::kN20OpenLoopSweepStepMs);
    return true;
}

void n20OpenLoopSweepPrint(const N20OpenLoopSweepRuntime& runtime,
                           uint32_t elapsed_ms,
                           const char* status) {
    if (!runtime.csv_header_printed) {
        Serial.println(
            "timestamp_ms,mode,pwm,actual_rpm,raw_rpm,filtered_rpm,encoder_delta,encoder_count,invalid_transitions,direction,status");
    }

    Serial.print(elapsed_ms);
    Serial.print(",open_loop,");
    Serial.print(runtime.last_pwm, 3);
    Serial.print(",");
    Serial.print(runtime.last_filtered_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.last_raw_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.last_filtered_rpm, 3);
    Serial.print(",");
    Serial.print(runtime.last_encoder_delta);
    Serial.print(",");
    Serial.print(runtime.last_encoder_count);
    Serial.print(",");
    Serial.print(n20EncoderBenchInvalidTransitionsSnapshot());
    Serial.print(",1,");
    Serial.println(status);
}

void serviceN20OpenLoopSweep(N20OpenLoopSweepRuntime& runtime, uint32_t now_ms) {
    size_t step_count = 0U;
    const float* steps = n20OpenLoopSweepPwmSteps(step_count);
    const uint32_t max_duration_ms =
        app_config::kN20OpenLoopSweepStepMs * (uint32_t)step_count;

    if (runtime.completed) {
        return;
    }

    if (step_count == 0U || app_config::kN20OpenLoopSweepStepMs == 0U) {
        n20OpenLoopSweepStop(runtime, "invalid config");
        runtime.completed = true;
        return;
    }

    if (!n20OpenLoopSweepInit(runtime, now_ms)) {
        return;
    }

    const uint32_t elapsed_ms = now_ms - runtime.start_ms;
    if (elapsed_ms >= max_duration_ms) {
        n20OpenLoopSweepStop(runtime, "complete");
        runtime.completed = true;
        Serial.println("[N20_OPEN_LOOP_SWEEP] profile complete");
        return;
    }

    const uint32_t step_index = elapsed_ms / app_config::kN20OpenLoopSweepStepMs;
    const float pwm = steps[step_index];
    runtime.tb6612.setStandby(true);
    if (!runtime.tb6612.writeDuty(Tb6612Channel::kB, pwm)) {
        n20OpenLoopSweepStop(runtime, "TB6612 writeDuty failed");
        runtime.completed = true;
        return;
    }
    runtime.last_pwm = pwm;

    if (!isIntervalDue(now_ms,
                       runtime.last_sample_ms,
                       app_config::kN20OpenLoopSweepPrintIntervalMs)) {
        return;
    }

    const uint32_t dt_ms = now_ms - runtime.last_sample_ms;
    runtime.last_sample_ms = now_ms;

    EncoderRpmEstimatorConfig encoder_config = {};
    encoder_config.counts_per_output_rev =
        app_config::kN20ClosedLoopBenchEncoderPulsesPerRev *
        app_config::kN20ClosedLoopBenchGearRatio *
        app_config::kN20ClosedLoopBenchEdgesPerPulse;
    encoder_config.filter_alpha = app_config::kN20ClosedLoopBenchEncoderFilterAlpha;

