inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
    Serial.println("[TB6612] B forward low-duty pulse");
    tb6612.writeDuty(Tb6612Channel::kB, app_config::kTb6612BenchTestDuty);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchPulseMs));
    const int32_t forward_count = n20EncoderBenchCountSnapshot();
    Serial.print("[ENC] after forward count=");
    Serial.print(forward_count);
    Serial.print(" delta=");
    Serial.println(forward_count - start_count);

    Serial.println("[TB6612] B coast");
    tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchCoastMs));

    Serial.println("[TB6612] B reverse low-duty pulse");
    tb6612.writeDuty(Tb6612Channel::kB, -app_config::kTb6612BenchTestDuty);
    vTaskDelay(pdMS_TO_TICKS(app_config::kTb6612BenchPulseMs));
    const int32_t reverse_count = n20EncoderBenchCountSnapshot();
    Serial.print("[ENC] after reverse count=");
    Serial.print(reverse_count);
    Serial.print(" delta=");
    Serial.println(reverse_count - forward_count);

    tb6612.writeOutput(Tb6612Channel::kB, Tb6612OutputMode::kCoast, 0.0f);
    tb6612.setStandby(false);
    stopN20EncoderBench();
    Serial.print("[ENC] invalid_transitions=");
    Serial.println(n20EncoderBenchInvalidTransitionsSnapshot());
    Serial.println("[TB6612] B-channel bench test complete; driver standby disabled");
}

void startWiFiConnectionAttempt() {
    Serial.print("Connecting to WiFi: ");
    Serial.println(app_config::kWifiSsid);
    WiFi.begin(app_config::kWifiSsid, app_config::kWifiPass);
    last_wifi_attempt_ms = millis();
}

void configureMicroRosTransport() {
    if (transport_configured) {
        return;
    }

    static micro_ros_agent_locator locator;
    locator.address.fromString(app_config::kAgentIp);
    locator.port = app_config::kAgentPort;

    rmw_uros_set_custom_transport(
        false,
        (void*)&locator,
        arduino_wifi_transport_open,
        arduino_wifi_transport_close,
        arduino_wifi_transport_write,
        arduino_wifi_transport_read);

    transport_configured = true;
    Serial.println("micro-ROS WiFi transport configured");
}

void printImuDebug(const char* source, float ax, float ay, float az,
                   float qx, float qy, float qz, float qw) {
    static unsigned long last_imu_debug_ms = 0;

    if (!app_config::kEnableImuDebug) {
        return;
    }
    if (app_config::kEnableN20ClosedLoopBench) {
        return;
    }

    if ((millis() - last_imu_debug_ms) < app_config::kImuDebugIntervalMs) {
        return;
    }
    last_imu_debug_ms = millis();

    Serial.print("[IMU ");
    Serial.print(source);
    Serial.print("] ax:");
    Serial.print(ax);
    Serial.print(" ay:");
    Serial.print(ay);
    Serial.print(" az:");
    Serial.print(az);
    Serial.print(" q:");
    Serial.print(qx, 3);
    Serial.print(",");
    Serial.print(qy, 3);
    Serial.print(",");
    Serial.print(qz, 3);
    Serial.print(",");
    Serial.println(qw, 3);
}

void printMotorDebug(const MotorControlStateSnapshot& state) {
    static unsigned long last_motor_debug_ms = 0;

    if (!app_config::kEnableBridgeRuntimeDebug) {
        return;
    }

    if ((millis() - last_motor_debug_ms) < app_config::kMotorControlDebugIntervalMs) {
        return;
    }
    last_motor_debug_ms = millis();

    Serial.print("[MOTOR] core=");
    Serial.print(xPortGetCoreID());
    Serial.print(" loop=");
    Serial.print(state.loop_count);
    Serial.print(" src=");
    Serial.print(motorCommandSourceName(state.active_source));
    Serial.print(" target_rpm=");
    Serial.print(state.target_rpm, 3);
    Serial.print(" actual_rpm=");
    Serial.print(state.actual_rpm, 3);
    Serial.print(" error_rpm=");
    Serial.print(state.error_rpm, 3);
    Serial.print(" enabled=");
    Serial.print(state.enabled ? 1 : 0);
    Serial.print(" control=");
    Serial.print(state.control_enabled ? 1 : 0);
    Serial.print(" closed_loop=");
    Serial.print(state.closed_loop ? 1 : 0);
    Serial.print(" max_pwm=");
    Serial.print(state.max_pwm_limit, 3);
    Serial.print(" timeout=");
    Serial.print(state.timeout_active ? 1 : 0);
    Serial.print(" stop=");
    Serial.print(state.estop_active ? 1 : 0);
    Serial.print(" legacy=");
    Serial.println(state.legacy_bridge_active ? 1 : 0);
}

void handleParsedImuSample(const STM32ImuSample& sample) {
    const unsigned long now_ms = millis();

    if (isIntervalDue(now_ms, last_imu_publish_ms, app_config::kImuPublishIntervalMs)) {
        urosPubPublishImuRaw(sample.ax, sample.ay, sample.az,
                             sample.gx, sample.gy, sample.gz,
                             sample.qx, sample.qy, sample.qz, sample.qw);
        last_imu_publish_ms = now_ms;
    }

    if (isIntervalDue(now_ms, last_filtered_imu_publish_ms, app_config::kFilteredImuPublishIntervalMs)) {
        urosPubPublishFilteredImu(sample.ax, sample.ay, sample.az,
                                  sample.gx, sample.gy, sample.gz,
                                  sample.qx, sample.qy, sample.qz, sample.qw);
        last_filtered_imu_publish_ms = now_ms;
    }

    printImuDebug(sample.source, sample.ax, sample.ay, sample.az,
                  sample.qx, sample.qy, sample.qz, sample.qw);
}

void handleParsedState(int32_t state) {
    const unsigned long now_ms = millis();
    if (!isIntervalDue(now_ms, last_robot_state_publish_ms, app_config::kRobotStatePublishIntervalMs)) {
        return;
    }

    urosPubPublishState(state);
    last_robot_state_publish_ms = now_ms;
}

void handleDebugLine(const char* line) {
    if (!app_config::kEnableStm32DebugLinePrint) {
        return;
    }

    Serial.print("[STM32] ");
    Serial.println(line);
}

void handleCmdVel(float linear_x, float angular_z) {
    char buffer[64];
    const int len = snprintf(buffer, sizeof(buffer), "CMDVEL,%.3f,%.3f\n", linear_x, angular_z);
    static unsigned long last_cmd_debug_ms = 0;

    if (len <= 0) {
        return;
    }

    STM32Serial.write((const uint8_t*)buffer, (size_t)len);
    motorSharedSetLegacyCmdVel(linear_x, angular_z, millis());

    if (!app_config::kEnableCmdVelDebug) {
        return;
    }

    if ((millis() - last_cmd_debug_ms) < app_config::kCmdVelDebugIntervalMs) {
        return;
    }

    Serial.print("[CMDVEL] core=");
    Serial.print(xPortGetCoreID());
    Serial.print(" vx=");
    Serial.print(linear_x, 3);
    Serial.print(" wz=");
    Serial.println(angular_z, 3);
    last_cmd_debug_ms = millis();
}

