inayina/ros2-robot-digital-twin/firmware/esp32_microros_bridge/src/main.cpp
    for (;;) {
        esp_task_wdt_reset();
        noteRosCommLoop();

        stm32_parser.handle(STM32Serial);

        while (Serial.available()) {
            STM32Serial.write((uint8_t)Serial.read());
        }

        serviceWiFiConnection();
        serviceMicroRosConnection();
        serviceConnectedRuntime();
        printRuntimeStatsIfDue();

        vTaskDelay(pdMS_TO_TICKS(app_config::kRosCommTaskDelayMs));
    }
}

void motorControlTask(void* /*arg*/) {
    esp_task_wdt_add(NULL);

    TickType_t last_wake_time = xTaskGetTickCount();
    uint32_t loop_count = 0;
    MotorControllerRuntime motor_runtime;
    N20OpenLoopSweepRuntime open_loop_sweep_runtime = {};
    N20ClosedLoopBenchRuntime closed_loop_bench_runtime = {};
    SingleMotorControlRuntime single_motor_runtime = {};
    EncoderRpmEstimatorRuntime motor_encoder_runtime = {};
    const DashboardMotorClosedLoopConfig dashboard_motor_config =
        makeDashboardMotorClosedLoopConfig();
    uint32_t motor_last_control_ms = 0U;
    motorControllerInit(motor_runtime);
    singleMotorControlInit(single_motor_runtime);
    encoderRpmEstimatorInit(motor_encoder_runtime);

    Serial.print("motor_control_task started on core ");
    Serial.println(xPortGetCoreID());
    runTb6612ChannelABenchTest();
    runTb6612ChannelBBenchTest();
    if (!app_config::kEnableN20ClosedLoopBench &&
        !app_config::kEnableN20OpenLoopPwmSweep) {
        startN20EncoderBench();
        encoderRpmEstimatorUpdate(
            motor_encoder_runtime,
            dashboard_motor_config.encoder,
            n20EncoderBenchCountSnapshot(),
            app_config::kMotorControlTaskPeriodMs);
        motor_last_control_ms = millis();
    }

    for (;;) {
        esp_task_wdt_reset();
        noteMotorControlLoop();
        loop_count++;

        const uint32_t now_ms = millis();
        if (app_config::kEnableN20OpenLoopPwmSweep) {
            serviceN20OpenLoopSweep(open_loop_sweep_runtime, now_ms);
        } else if (app_config::kEnableN20ClosedLoopBench) {
            serviceN20ClosedLoopBench(closed_loop_bench_runtime, now_ms);
        } else {
            const MotorControlCommandSnapshot command = motorSharedGetCommand();
            uint32_t dt_ms =
                motor_last_control_ms == 0U
                    ? app_config::kMotorControlTaskPeriodMs
                    : now_ms - motor_last_control_ms;
            if (dt_ms == 0U) {
                dt_ms = app_config::kMotorControlTaskPeriodMs;
            }
            motor_last_control_ms = now_ms;

            EncoderRpmEstimatorSample encoder_sample =
                encoderRpmEstimatorUpdate(
                    motor_encoder_runtime,
                    dashboard_motor_config.encoder,
                    n20EncoderBenchCountSnapshot(),
                    dt_ms);
            if (dashboard_motor_config.invert_encoder_direction) {
                encoder_sample.delta_count = -encoder_sample.delta_count;
                encoder_sample.direction = (int8_t)-encoder_sample.direction;
                encoder_sample.actual_rpm = -encoder_sample.actual_rpm;
                encoder_sample.filtered_rpm = -encoder_sample.filtered_rpm;
            }

            const bool hardware_outputs_enabled = motorControllerHardwareOutputsEnabled();
            MotorControlStateSnapshot state =
                singleMotorControlUpdate(
                    single_motor_runtime,
                    dashboard_motor_config.control,
                    command,
                    encoder_sample.filtered_rpm,
                    encoder_sample.valid && hardware_outputs_enabled,
                    now_ms,
                    dt_ms,
                    loop_count);
            state.hardware_outputs_enabled = motorControllerHardwareOutputsEnabled();

            motorControllerApplyHardwareOutputs(state);
            motorSharedSetState(state);
            printMotorDebug(state);
        }

        vTaskDelayUntil(&last_wake_time, pdMS_TO_TICKS(app_config::kMotorControlTaskPeriodMs));
    }
}

void createPinnedTask(TaskFunction_t task_fn,
                      const char* task_name,
                      uint32_t stack_bytes,
                      UBaseType_t priority,
                      TaskHandle_t* out_handle,
                      BaseType_t core_id) {
    BaseType_t ret = xTaskCreatePinnedToCore(
        task_fn,
        task_name,
        stack_bytes,
        nullptr,
        priority,
        out_handle,
        core_id);

    if (ret == pdPASS) {
        return;
    }

    Serial.print("Failed to create task: ");
    Serial.println(task_name);
    for (;;) {
        delay(1000);
    }
}

}  // namespace

void setup() {
    esp_task_wdt_init(60, true);

    Serial.begin(app_config::kUsbSerialBaud);
    delay(1000);
    Serial.println("ESP32-S3 micro-ROS Bridge v1.2 dual-core - Starting...");
    Serial.print("Build: ");
    Serial.print(__DATE__);
    Serial.print(" ");
    Serial.println(__TIME__);

    motorSharedInit();

    STM32Serial.begin(app_config::kUartBaud, SERIAL_8N1, app_config::kUartRx, app_config::kUartTx);
    Serial.println("STM32 Serial initialized");
    delay(50);
    STM32Serial.write('G');
    STM32Serial.write('\n');
    Serial.println("Requested STM32 GAZEBO mode");

    createPinnedTask(
        rosCommTask,
        "ros_comm_task",
        app_config::kRosCommTaskStackBytes,
        app_config::kRosCommTaskPriority,
        &ros_comm_task_handle,
        app_config::kRosCommTaskCore);

    createPinnedTask(
        motorControlTask,
        "motor_control_task",
        app_config::kMotorControlTaskStackBytes,
        app_config::kMotorControlTaskPriority,
        &motor_control_task_handle,
        app_config::kMotorControlTaskCore);

    Serial.println("Dual-core task layout ready");
}

void loop() {
    vTaskDelay(pdMS_TO_TICKS(1000));
}
